INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('1', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('2', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('3', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('4', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('5', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('6', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('7', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('8', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('9', '1', '1', '123', '123', '123', '123', '22');
INSERT INTO `cyflow`.`asset` (`asset_id`, `file_type`, `busi_type`, `username`, `gid`, `description`, `url`, `origin_name`) VALUES ('10', '1', '1', '123', '123', '123', '123', '22');


--保证金
INSERT INTO `deposit` (`id`, `flowId`, `expectedAmount`, `actuallyAmount`, `state`, `memo`, `operator`, `ts_c`, `ts_u`)
VALUES
	(1, '123456', 50.00, 100.00, 'notified', 'hehe, this is just a test', 'haha', '2017-01-11 09:37:06', '2017-01-10 19:38:46');

--公司
INSERT INTO `party_instance` (`id`, `party_class`, `instance_id`, `party_name`, `disable`, `ts_c`)
VALUES
	(3, 'financer', '15011101', '融资方A公司', 0, '2017-01-11 11:46:08'),
	(4, 'financer', '15011102', '融资方B公司', 0, '2017-01-11 11:46:08'),
	(5, 'financer', '15011103', '融资方C公司', 0, '2017-01-11 11:46:08'),
	(6, 'harbor', '15011104', '上海港', 0, '2017-01-11 11:46:08'),
	(7, 'harbor', '15011105', '武汉港', 0, '2017-01-11 11:46:08'),
	(8, 'harbor', '15011106', '南京港', 0, '2017-01-11 11:46:08'),
	(9, 'supervisor', '15011107', '监管方A公司', 0, '2017-01-11 11:46:08'),
	(10, 'supervisor', '15011108', '监管方B公司', 0, '2017-01-11 11:46:08'),
	(11, 'supervisor', '15011109', '监管方C公司', 0, '2017-01-11 11:46:08'),
	(12, 'fundProvider', '15011110', '资金方A公司', 0, '2017-01-11 11:46:08'),
	(13, 'fundProvider', '15011111', '资金方B公司', 0, '2017-01-11 11:46:08'),
	(14, 'fundProvider', '15011112', '资金方C公司', 0, '2017-01-11 11:46:08');

--用户
INSERT INTO `party_user` (`id`, `party_id`, `user_id`, `username`, `password`, `phone`, `email`, `name`, `disable`, `ts_c`)
VALUES
	(6, 3, '66661', 'rza1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(7, 3, '66662', 'rza2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(8, 4, '66663', 'rzb1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(9, 4, '66664', 'rzb2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(10, 5, '66665', 'rzc1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(11, 5, '66666', 'rzc2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(12, 6, '55551', 'sh1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(13, 6, '55552', 'sh2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(14, 7, '55553', 'wh1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(15, 7, '55554', 'wh2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(16, 8, '55555', 'nj1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(17, 8, '55556', 'nj2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(18, 9, '22221', 'jga1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(19, 9, '22222', 'jga2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(20, 10, '22223', 'jgb1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(21, 10, '22224', 'jgb2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(22, 11, '22225', 'jgc1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(23, 11, '22226', 'jgc2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(24, 12, '33331', 'zja1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(25, 12, '33332', 'zja2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(26, 13, '33333', 'zjb1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(27, 13, '33334', 'zjb2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(28, 14, '33335', 'zjc1', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08'),
	(29, 14, '33336', 'zjc2', '123456', '13800000001', '12345@12345.com', 'ymFinance', 0, '2017-01-11 11:46:08');

--组关系
INSERT INTO `user_group` (`id`, `party_id`, `gid`, `user_id`, `ts_c`)
VALUES
	(3, 12, '1', '33331', '2017-01-11 18:12:30'),
	(4, 12, '2', '33332', '2017-01-11 18:12:30'),
	(5, 13, '1', '33333', '2017-01-11 18:12:30'),
	(6, 13, '2', '33334', '2017-01-11 18:12:30'),
	(7, 14, '1', '33335', '2017-01-11 18:12:30'),
	(8, 14, '2', '33336', '2017-01-11 18:12:30');
